bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x3.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DMA2</name>
         <description>DMA controller</description>
         <groupName>DMA</groupName>
         <baseAddress>0x40026400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DMA2_Stream0</name>
            <description>DMA2 Stream0 global interrupt</description>
            <value>56</value>
         </interrupt>
         <interrupt>
            <name>DMA2_Stream1</name>
            <description>DMA2 Stream1 global interrupt</description>
            <value>57</value>
         </interrupt>
         <interrupt>
            <name>DMA2_Stream2</name>
            <description>DMA2 Stream2 global interrupt</description>
            <value>58</value>
         </interrupt>
         <interrupt>
            <name>DMA2_Stream3</name>
            <description>DMA2 Stream3 global interrupt</description>
            <value>59</value>
         </interrupt>
         <interrupt>
            <name>DMA2_Stream4</name>
            <description>DMA2 Stream4 global interrupt</description>
            <value>60</value>
         </interrupt>
         <interrupt>
            <name>DMA2_Stream5</name>
            <description>DMA2 Stream5 global interrupt</description>
            <value>68</value>
         </interrupt>
         <interrupt>
            <name>DMA2_Stream6</name>
            <description>DMA2 Stream6 global interrupt</description>
            <value>69</value>
         </interrupt>
         <interrupt>
            <name>DMA2_Stream7</name>
            <description>DMA2 Stream7 global interrupt</description>
            <value>70</value>
         </interrupt>
         <registers>
            <register>
               <name>LISR</name>
               <displayName>LISR</displayName>
               <description>low interrupt status register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TCIF3</name>
                     <description>Stream x transfer complete interrupt               flag (x = 3..0)</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTIF3</name>
                     <description>Stream x half transfer interrupt flag               (x=3..0)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEIF3</name>
                     <description>Stream x transfer error interrupt flag               (x=3..0)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMEIF3</name>
                     <description>Stream x direct mode error interrupt               flag (x=3..0)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FEIF3</name>
                     <description>Stream x FIFO error interrupt flag               (x=3..0)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCIF2</name>
                     <description>Stream x transfer complete interrupt               flag (x = 3..0)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTIF2</name>
                     <description>Stream x half transfer interrupt flag               (x=3..0)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEIF2</name>
                     <description>Stream x transfer error interrupt flag               (x=3..0)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMEIF2</name>
                     <description>Stream x direct mode error interrupt               flag (x=3..0)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FEIF2</name>
                     <description>Stream x FIFO error interrupt flag               (x=3..0)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCIF1</name>
                     <description>Stream x transfer complete interrupt               flag (x = 3..0)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTIF1</name>
                     <description>Stream x half transfer interrupt flag               (x=3..0)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEIF1</name>
                     <description>Stream x transfer error interrupt flag               (x=3..0)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMEIF1</name>
                     <description>Stream x direct mode error interrupt               flag (x=3..0)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FEIF1</name>
                     <description>Stream x FIFO error interrupt flag               (x=3..0)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCIF0</name>
                     <description>Stream x transfer complete interrupt               flag (x = 3..0)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTIF0</name>
                     <description>Stream x half transfer interrupt flag               (x=3..0)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEIF0</name>
                     <description>Stream x transfer error interrupt flag               (x=3..0)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMEIF0</name>
                     <description>Stream x direct mode error interrupt               flag (x=3..0)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FEIF0</name>
                     <description>Stream x FIFO error interrupt flag               (x=3..0)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HISR</name>
               <displayName>HISR</displayName>
               <description>high interrupt status register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TCIF7</name>
                     <description>Stream x transfer complete interrupt               flag (x=7..4)</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTIF7</name>
                     <description>Stream x half transfer interrupt flag               (x=7..4)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEIF7</name>
                     <description>Stream x transfer error interrupt flag               (x=7..4)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMEIF7</name>
                     <description>Stream x direct mode error interrupt               flag (x=7..4)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FEIF7</name>
                     <description>Stream x FIFO error interrupt flag               (x=7..4)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCIF6</name>
                     <description>Stream x transfer complete interrupt               flag (x=7..4)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTIF6</name>
                     <description>Stream x half transfer interrupt flag               (x=7..4)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEIF6</name>
                     <description>Stream x transfer error interrupt flag               (x=7..4)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMEIF6</name>
                     <description>Stream x direct mode error interrupt               flag (x=7..4)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FEIF6</name>
                     <description>Stream x FIFO error interrupt flag               (x=7..4)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCIF5</name>
                     <description>Stream x transfer complete interrupt               flag (x=7..4)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTIF5</name>
                     <description>Stream x half transfer interrupt flag               (x=7..4)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEIF5</name>
                     <description>Stream x transfer error interrupt flag               (x=7..4)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMEIF5</name>
                     <description>Stream x direct mode error interrupt               flag (x=7..4)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FEIF5</name>
                     <description>Stream x FIFO error interrupt flag               (x=7..4)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCIF4</name>
                     <description>Stream x transfer complete interrupt               flag (x=7..4)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTIF4</name>
                     <description>Stream x half transfer interrupt flag               (x=7..4)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEIF4</name>
                     <description>Stream x transfer error interrupt flag               (x=7..4)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMEIF4</name>
                     <description>Stream x direct mode error interrupt               flag (x=7..4)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FEIF4</name>
                     <description>Stream x FIFO error interrupt flag               (x=7..4)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LIFCR</name>
               <displayName>LIFCR</displayName>
               <description>low interrupt flag clear           register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CTCIF3</name>
                     <description>Stream x clear transfer complete               interrupt flag (x = 3..0)</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHTIF3</name>
                     <description>Stream x clear half transfer interrupt               flag (x = 3..0)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTEIF3</name>
                     <description>Stream x clear transfer error interrupt               flag (x = 3..0)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CDMEIF3</name>
                     <description>Stream x clear direct mode error               interrupt flag (x = 3..0)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFEIF3</name>
                     <description>Stream x clear FIFO error interrupt flag               (x = 3..0)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTCIF2</name>
                     <description>Stream x clear transfer complete               interrupt flag (x = 3..0)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHTIF2</name>
                     <description>Stream x clear half transfer interrupt               flag (x = 3..0)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTEIF2</name>
                     <description>Stream x clear transfer error interrupt               flag (x = 3..0)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CDMEIF2</name>
                     <description>Stream x clear direct mode error               interrupt flag (x = 3..0)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFEIF2</name>
                     <description>Stream x clear FIFO error interrupt flag               (x = 3..0)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTCIF1</name>
                     <description>Stream x clear transfer complete               interrupt flag (x = 3..0)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHTIF1</name>
                     <description>Stream x clear half transfer interrupt               flag (x = 3..0)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTEIF1</name>
                     <description>Stream x clear transfer error interrupt               flag (x = 3..0)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CDMEIF1</name>
                     <description>Stream x clear direct mode error               interrupt flag (x = 3..0)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFEIF1</name>
                     <description>Stream x clear FIFO error interrupt flag               (x = 3..0)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTCIF0</name>
                     <description>Stream x clear transfer complete               interrupt flag (x = 3..0)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHTIF0</name>
                     <description>Stream x clear half transfer interrupt               flag (x = 3..0)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTEIF0</name>
                     <description>Stream x clear transfer error interrupt               flag (x = 3..0)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CDMEIF0</name>
                     <description>Stream x clear direct mode error               interrupt flag (x = 3..0)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFEIF0</name>
                     <description>Stream x clear FIFO error interrupt flag               (x = 3..0)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
