bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x3.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="DMA2">
         <name>DMA1</name>
         <baseAddress>0x40026000</baseAddress>
         <interrupt>
            <name>DMA1_Stream0</name>
            <description>DMA1 Stream0 global interrupt</description>
            <value>11</value>
         </interrupt>
         <interrupt>
            <name>DMA1_Stream1</name>
            <description>DMA1 Stream1 global interrupt</description>
            <value>12</value>
         </interrupt>
         <interrupt>
            <name>DMA1_Stream2</name>
            <description>DMA1 Stream2 global interrupt</description>
            <value>13</value>
         </interrupt>
         <interrupt>
            <name>DMA1_Stream3</name>
            <description>DMA1 Stream3 global interrupt</description>
            <value>14</value>
         </interrupt>
         <interrupt>
            <name>DMA1_Stream4</name>
            <description>DMA1 Stream4 global interrupt</description>
            <value>15</value>
         </interrupt>
         <interrupt>
            <name>DMA1_Stream5</name>
            <description>DMA1 Stream5 global interrupt</description>
            <value>16</value>
         </interrupt>
         <interrupt>
            <name>DMA1_Stream6</name>
            <description>DMA1 Stream6 global interrupt</description>
            <value>17</value>
         </interrupt>
         <interrupt>
            <name>DMA1_Stream7</name>
            <description>DMA1 Stream7 global interrupt</description>
            <value>47</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>EXTI</name>
         <description>External interrupt/event       controller</description>
         <groupName>EXTI</groupName>
         <baseAddress>0x40013C00</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PVD</name>
            <description>PVD through EXTI line detection
        interrupt</description>
            <value>1</value>
         </interrupt>
         <interrupt>
            <name>TAMP_STAMP</name>
            <description>Tamper and TimeStamp interrupts through the
        EXTI line</description>
            <value>2</value>
         </interrupt>
         <interrupt>
            <name>EXTI0</name>
            <description>EXTI Line0 interrupt</description>
            <value>6</value>
         </interrupt>
         <interrupt>
            <name>EXTI1</name>
            <description>EXTI Line1 interrupt</description>
            <value>7</value>
         </interrupt>
         <interrupt>
            <name>EXTI2</name>
            <description>EXTI Line2 interrupt</description>
            <value>8</value>
         </interrupt>
         <interrupt>
            <name>EXTI3</name>
            <description>EXTI Line3 interrupt</description>
            <value>9</value>
         </interrupt>
         <interrupt>
            <name>EXTI4</name>
            <description>EXTI Line4 interrupt</description>
            <value>10</value>
         </interrupt>
         <interrupt>
            <name>EXTI9_5</name>
            <description>EXTI Line[9:5] interrupts</description>
            <value>23</value>
         </interrupt>
         <interrupt>
            <name>EXTI15_10</name>
            <description>EXTI Line[15:10] interrupts</description>
            <value>40</value>
         </interrupt>
         <registers>
            <register>
               <name>IMR</name>
               <displayName>IMR</displayName>
               <description>Interrupt mask register           (EXTI_IMR)</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IM0</name>
                     <description>Interrupt Mask on line 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM1</name>
                     <description>Interrupt Mask on line 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM2</name>
                     <description>Interrupt Mask on line 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM3</name>
                     <description>Interrupt Mask on line 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM4</name>
                     <description>Interrupt Mask on line 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM5</name>
                     <description>Interrupt Mask on line 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM6</name>
                     <description>Interrupt Mask on line 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM7</name>
                     <description>Interrupt Mask on line 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM8</name>
                     <description>Interrupt Mask on line 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MI9</name>
                     <description>Interrupt Mask on line 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM10</name>
                     <description>Interrupt Mask on line 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM11</name>
                     <description>Interrupt Mask on line 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM12</name>
                     <description>Interrupt Mask on line 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM13</name>
                     <description>Interrupt Mask on line 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM14</name>
                     <description>Interrupt Mask on line 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM15</name>
                     <description>Interrupt Mask on line 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM16</name>
                     <description>Interrupt Mask on line 16</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM17</name>
                     <description>Interrupt Mask on line 17</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM18</name>
                     <description>Interrupt Mask on line 18</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM19</name>
                     <description>Interrupt Mask on line 19</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM20</name>
                     <description>Interrupt Mask on line 20</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM21</name>
                     <description>Interrupt Mask on line 21</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM22</name>
                     <description>Interrupt Mask on line 22</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM23</name>
                     <description>Interrupt Mask on line 23</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EMR</name>
               <displayName>EMR</displayName>
               <description>Event mask register (EXTI_EMR)</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EM0</name>
                     <description>Event Mask on line 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM1</name>
                     <description>Event Mask on line 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM2</name>
                     <description>Event Mask on line 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM3</name>
                     <description>Event Mask on line 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM4</name>
                     <description>Event Mask on line 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM5</name>
                     <description>Event Mask on line 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM6</name>
                     <description>Event Mask on line 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM7</name>
                     <description>Event Mask on line 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM8</name>
                     <description>Event Mask on line 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM9</name>
                     <description>Event Mask on line 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM10</name>
                     <description>Event Mask on line 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM11</name>
                     <description>Event Mask on line 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM12</name>
                     <description>Event Mask on line 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM13</name>
                     <description>Event Mask on line 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM14</name>
                     <description>Event Mask on line 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM15</name>
                     <description>Event Mask on line 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM16</name>
                     <description>Event Mask on line 16</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM17</name>
                     <description>Event Mask on line 17</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM18</name>
                     <description>Event Mask on line 18</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM19</name>
                     <description>Event Mask on line 19</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM20</name>
                     <description>Event Mask on line 20</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM21</name>
                     <description>Event Mask on line 21</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM22</name>
                     <description>Event Mask on line 22</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EM23</name>
                     <description>Event Mask on line 23</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
