bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x3.svd
            <register>
               <name>APB2LPENR</name>
               <displayName>APB2LPENR</displayName>
               <description>APB2 peripheral clock enabled in low power           mode register</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00075F33</resetValue>
               <fields>
                  <field>
                     <name>TIM1LPEN</name>
                     <description>TIM1 clock enable during Sleep               mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM8LPEN</name>
                     <description>TIM8 clock enable during Sleep               mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART1LPEN</name>
                     <description>USART1 clock enable during Sleep               mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART6LPEN</name>
                     <description>USART6 clock enable during Sleep               mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC1LPEN</name>
                     <description>ADC1 clock enable during Sleep               mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC2LPEN</name>
                     <description>ADC2 clock enable during Sleep               mode</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC3LPEN</name>
                     <description>ADC 3 clock enable during Sleep               mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI1LPEN</name>
                     <description>SPI 1 clock enable during Sleep               mode</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI4LPEN</name>
                     <description>SPI 4 clock enable during Sleep               mode</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYSCFGLPEN</name>
                     <description>System configuration controller clock               enable during Sleep mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM9LPEN</name>
                     <description>TIM9 clock enable during sleep               mode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM10LPEN</name>
                     <description>TIM10 clock enable during Sleep               mode</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM11LPEN</name>
                     <description>TIM11 clock enable during Sleep               mode</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI5LPEN</name>
                     <description>SPI 5 clock enable during Sleep               mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAI1LPEN</name>
                     <description>SAI1 clock enable during sleep               mode</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAI2LPEN</name>
                     <description>SAI2 clock enable during sleep               mode</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDMMC1LPEN</name>
                     <description>SDMMC1 clock enable during Sleep               mode</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDMMC2LPEN</name>
                     <description>SDMMC2 clock enable during Sleep               mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BDCR</name>
               <displayName>BDCR</displayName>
               <description>Backup domain control register</description>
               <addressOffset>0x70</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BDRST</name>
                     <description>Backup domain software               reset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCEN</name>
                     <description>RTC clock enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCSEL1</name>
                     <description>RTC clock source selection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCSEL0</name>
                     <description>RTC clock source selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSEBYP</name>
                     <description>External low-speed oscillator               bypass</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSERDY</name>
                     <description>External low-speed oscillator               ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LSEON</name>
                     <description>External low-speed oscillator               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR</name>
               <displayName>CSR</displayName>
               <description>clock control &amp; status           register</description>
               <addressOffset>0x74</addressOffset>
               <size>0x20</size>
               <resetValue>0x0E000000</resetValue>
               <fields>
                  <field>
                     <name>LPWRRSTF</name>
                     <description>Low-power reset flag</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WWDGRSTF</name>
                     <description>Window watchdog reset flag</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WDGRSTF</name>
                     <description>Independent watchdog reset               flag</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SFTRSTF</name>
                     <description>Software reset flag</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PORRSTF</name>
                     <description>POR/PDR reset flag</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PADRSTF</name>
                     <description>PIN reset flag</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BORRSTF</name>
                     <description>BOR reset flag</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RMVF</name>
                     <description>Remove reset flag</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSIRDY</name>
                     <description>Internal low-speed oscillator               ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LSION</name>
                     <description>Internal low-speed oscillator               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSCGR</name>
               <displayName>SSCGR</displayName>
               <description>spread spectrum clock generation           register</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SSCGEN</name>
                     <description>Spread spectrum modulation               enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPREADSEL</name>
                     <description>Spread Select</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INCSTEP</name>
                     <description>Incrementation step</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
                  <field>
                     <name>MODPER</name>
                     <description>Modulation period</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLLI2SCFGR</name>
               <displayName>PLLI2SCFGR</displayName>
               <description>PLLI2S configuration register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x20003000</resetValue>
               <fields>
                  <field>
                     <name>PLLI2SR</name>
                     <description>PLLI2S division factor for I2S               clocks</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>PLLI2SQ</name>
                     <description>PLLI2S division factor for SAI1               clock</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PLLI2SN</name>
                     <description>PLLI2S multiplication factor for               VCO</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLLSAICFGR</name>
               <displayName>PLLSAICFGR</displayName>
               <description>PLL configuration register</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x20003000</resetValue>
               <fields>
                  <field>
                     <name>PLLSAIN</name>
                     <description>PLLSAI division factor for               VCO</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAIP</name>
                     <description>PLLSAI division factor for 48MHz               clock</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAIQ</name>
                     <description>PLLSAI division factor for SAI               clock</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCKCFGR1</name>
               <displayName>DCKCFGR1</displayName>
               <description>dedicated clocks configuration           register</description>
               <addressOffset>0x8C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x20003000</resetValue>
               <fields>
                  <field>
                     <name>PLLI2SDIV</name>
                     <description>PLLI2S division factor for SAI1               clock</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAIDIVQ</name>
                     <description>PLLSAI division factor for SAI1               clock</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SAI1SEL</name>
                     <description>SAI1 clock source               selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SAI2SEL</name>
                     <description>SAI2 clock source               selection</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TIMPRE</name>
                     <description>Timers clocks prescalers               selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCKCFGR2</name>
               <displayName>DCKCFGR2</displayName>
               <description>dedicated clocks configuration           register</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x20003000</resetValue>
               <fields>
                  <field>
                     <name>UART1SEL</name>
                     <description>USART 1 clock source               selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>UART2SEL</name>
                     <description>USART 2 clock source               selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>UART3SEL</name>
                     <description>USART 3 clock source               selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>UART4SEL</name>
                     <description>UART 4 clock source               selection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>UART5SEL</name>
                     <description>UART 5 clock source               selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>UART6SEL</name>
                     <description>USART 6 clock source               selection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>UART7SEL</name>
                     <description>UART 7 clock source               selection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>UART8SEL</name>
                     <description>UART 8 clock source               selection</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>I2C1SEL</name>
                     <description>I2C1 clock source               selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>I2C2SEL</name>
                     <description>I2C2 clock source               selection</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>I2C3SEL</name>
                     <description>I2C3 clock source               selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LPTIM1SEL</name>
                     <description>Low power timer 1 clock source               selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CK48MSEL</name>
                     <description>48MHz clock source               selection</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDMMC1SEL</name>
                     <description>SDMMC1 clock source               selection</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDMMC2SEL</name>
                     <description>SDMMC2 clock source               selection</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
