bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x3.svd
            <register>
               <name>OTG_HS_DOEPCTL2</name>
               <displayName>OTG_HS_DOEPCTL2</displayName>
               <description>OTG device endpoint-2 control           register</description>
               <addressOffset>0x340</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>MPSIZ</name>
                     <description>Maximum packet size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>USBAEP</name>
                     <description>USB active endpoint</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EONUM_DPID</name>
                     <description>Even odd frame/Endpoint data               PID</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NAKSTS</name>
                     <description>NAK status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EPTYP</name>
                     <description>Endpoint type</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SNPM</name>
                     <description>Snoop mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>Stall</name>
                     <description>STALL handshake</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNAK</name>
                     <description>Clear NAK</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SNAK</name>
                     <description>Set NAK</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SD0PID_SEVNFRM</name>
                     <description>Set DATA0 PID/Set even               frame</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SODDFRM</name>
                     <description>Set odd frame</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>EPDIS</name>
                     <description>Endpoint disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPENA</name>
                     <description>Endpoint enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPCTL3</name>
               <displayName>OTG_HS_DOEPCTL3</displayName>
               <description>OTG device endpoint-3 control           register</description>
               <addressOffset>0x360</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>MPSIZ</name>
                     <description>Maximum packet size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>USBAEP</name>
                     <description>USB active endpoint</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EONUM_DPID</name>
                     <description>Even odd frame/Endpoint data               PID</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NAKSTS</name>
                     <description>NAK status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EPTYP</name>
                     <description>Endpoint type</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SNPM</name>
                     <description>Snoop mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>Stall</name>
                     <description>STALL handshake</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNAK</name>
                     <description>Clear NAK</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SNAK</name>
                     <description>Set NAK</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SD0PID_SEVNFRM</name>
                     <description>Set DATA0 PID/Set even               frame</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SODDFRM</name>
                     <description>Set odd frame</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>EPDIS</name>
                     <description>Endpoint disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPENA</name>
                     <description>Endpoint enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPINT0</name>
               <displayName>OTG_HS_DOEPINT0</displayName>
               <description>OTG_HS device endpoint-0 interrupt           register</description>
               <addressOffset>0x308</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000080</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed               interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>Endpoint disabled               interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STUP</name>
                     <description>SETUP phase done</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTEPDIS</name>
                     <description>OUT token received when endpoint               disabled</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B2BSTUP</name>
                     <description>Back-to-back SETUP packets               received</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NYET</name>
                     <description>NYET interrupt</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPINT1</name>
               <displayName>OTG_HS_DOEPINT1</displayName>
               <description>OTG_HS device endpoint-1 interrupt           register</description>
               <addressOffset>0x328</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed               interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>Endpoint disabled               interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STUP</name>
                     <description>SETUP phase done</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTEPDIS</name>
                     <description>OUT token received when endpoint               disabled</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B2BSTUP</name>
                     <description>Back-to-back SETUP packets               received</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NYET</name>
                     <description>NYET interrupt</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPINT2</name>
               <displayName>OTG_HS_DOEPINT2</displayName>
               <description>OTG_HS device endpoint-2 interrupt           register</description>
               <addressOffset>0x348</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed               interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>Endpoint disabled               interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STUP</name>
                     <description>SETUP phase done</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTEPDIS</name>
                     <description>OUT token received when endpoint               disabled</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B2BSTUP</name>
                     <description>Back-to-back SETUP packets               received</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NYET</name>
                     <description>NYET interrupt</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPINT3</name>
               <displayName>OTG_HS_DOEPINT3</displayName>
               <description>OTG_HS device endpoint-3 interrupt           register</description>
               <addressOffset>0x368</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed               interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>Endpoint disabled               interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STUP</name>
                     <description>SETUP phase done</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTEPDIS</name>
                     <description>OUT token received when endpoint               disabled</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B2BSTUP</name>
                     <description>Back-to-back SETUP packets               received</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NYET</name>
                     <description>NYET interrupt</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPINT4</name>
               <displayName>OTG_HS_DOEPINT4</displayName>
               <description>OTG_HS device endpoint-4 interrupt           register</description>
               <addressOffset>0x388</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed               interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>Endpoint disabled               interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STUP</name>
                     <description>SETUP phase done</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTEPDIS</name>
                     <description>OUT token received when endpoint               disabled</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B2BSTUP</name>
                     <description>Back-to-back SETUP packets               received</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NYET</name>
                     <description>NYET interrupt</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPINT5</name>
               <displayName>OTG_HS_DOEPINT5</displayName>
               <description>OTG_HS device endpoint-5 interrupt           register</description>
               <addressOffset>0x3A8</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed               interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>Endpoint disabled               interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STUP</name>
                     <description>SETUP phase done</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTEPDIS</name>
                     <description>OUT token received when endpoint               disabled</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B2BSTUP</name>
                     <description>Back-to-back SETUP packets               received</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NYET</name>
                     <description>NYET interrupt</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPINT6</name>
               <displayName>OTG_HS_DOEPINT6</displayName>
               <description>OTG_HS device endpoint-6 interrupt           register</description>
               <addressOffset>0x3C8</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed               interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>Endpoint disabled               interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STUP</name>
                     <description>SETUP phase done</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTEPDIS</name>
                     <description>OUT token received when endpoint               disabled</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B2BSTUP</name>
                     <description>Back-to-back SETUP packets               received</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NYET</name>
                     <description>NYET interrupt</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
