bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x3.svd
            <register>
               <name>OTG_HS_DOEPCTL6</name>
               <displayName>OTG_HS_DOEPCTL6</displayName>
               <description>OTG device endpoint-6 control           register</description>
               <addressOffset>0x3C0</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>MPSIZ</name>
                     <description>Maximum packet size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>USBAEP</name>
                     <description>USB active endpoint</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EONUM_DPID</name>
                     <description>Even odd frame/Endpoint data               PID</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NAKSTS</name>
                     <description>NAK status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EPTYP</name>
                     <description>Endpoint type</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SNPM</name>
                     <description>Snoop mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>Stall</name>
                     <description>STALL handshake</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNAK</name>
                     <description>Clear NAK</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SNAK</name>
                     <description>Set NAK</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SD0PID_SEVNFRM</name>
                     <description>Set DATA0 PID/Set even               frame</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SODDFRM</name>
                     <description>Set odd frame</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>EPDIS</name>
                     <description>Endpoint disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPENA</name>
                     <description>Endpoint enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPCTL7</name>
               <displayName>OTG_HS_DOEPCTL7</displayName>
               <description>OTG device endpoint-7 control           register</description>
               <addressOffset>0x3E0</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>MPSIZ</name>
                     <description>Maximum packet size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>USBAEP</name>
                     <description>USB active endpoint</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EONUM_DPID</name>
                     <description>Even odd frame/Endpoint data               PID</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NAKSTS</name>
                     <description>NAK status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EPTYP</name>
                     <description>Endpoint type</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SNPM</name>
                     <description>Snoop mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>Stall</name>
                     <description>STALL handshake</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNAK</name>
                     <description>Clear NAK</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SNAK</name>
                     <description>Set NAK</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SD0PID_SEVNFRM</name>
                     <description>Set DATA0 PID/Set even               frame</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SODDFRM</name>
                     <description>Set odd frame</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>EPDIS</name>
                     <description>Endpoint disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPENA</name>
                     <description>Endpoint enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPTSIZ5</name>
               <displayName>OTG_HS_DOEPTSIZ5</displayName>
               <description>OTG_HS device endpoint-5 transfer size           register</description>
               <addressOffset>0x3B0</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>RXDPID_STUPCNT</name>
                     <description>Received data PID/SETUP packet               count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPTSIZ6</name>
               <displayName>OTG_HS_DOEPTSIZ6</displayName>
               <description>OTG_HS device endpoint-6 transfer size           register</description>
               <addressOffset>0x3D0</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>RXDPID_STUPCNT</name>
                     <description>Received data PID/SETUP packet               count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPTSIZ7</name>
               <displayName>OTG_HS_DOEPTSIZ7</displayName>
               <description>OTG_HS device endpoint-7 transfer size           register</description>
               <addressOffset>0x3F0</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>RXDPID_STUPCNT</name>
                     <description>Received data PID/SETUP packet               count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPDMA0</name>
               <displayName>OTG_HS_DOEPDMA0</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x314</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DOEPDMA1</name>
               <displayName>OTG_HS_DOEPDMA1</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x334</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DOEPDMA2</name>
               <displayName>OTG_HS_DOEPDMA2</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x354</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DOEPDMA3</name>
               <displayName>OTG_HS_DOEPDMA3</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x374</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DOEPDMA4</name>
               <displayName>OTG_HS_DOEPDMA4</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x394</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DOEPDMA5</name>
               <displayName>OTG_HS_DOEPDMA5</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x3B4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DOEPDMA6</name>
               <displayName>OTG_HS_DOEPDMA6</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x3D4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DOEPDMA7</name>
               <displayName>OTG_HS_DOEPDMA7</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x3F4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DOEPDMA8</name>
               <displayName>OTG_HS_DOEPDMA8</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x414</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DOEPDMA9</name>
               <displayName>OTG_HS_DOEPDMA9</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x434</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DOEPDMA10</name>
               <displayName>OTG_HS_DOEPDMA10</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x454</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DOEPDMA11</name>
               <displayName>OTG_HS_DOEPDMA11</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x474</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DOEPDMA12</name>
               <displayName>OTG_HS_DOEPDMA12</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x494</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DOEPDMA13</name>
               <displayName>OTG_HS_DOEPDMA13</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x4B4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DOEPDMA14</name>
               <displayName>OTG_HS_DOEPDMA14</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x4D4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DOEPDMA15</name>
               <displayName>OTG_HS_DOEPDMA15</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x4F4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DIEPDMA5</name>
               <displayName>OTG_HS_DIEPDMA5</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x1B4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DIEPDMA6</name>
               <displayName>OTG_HS_DIEPDMA6</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x1D4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DIEPDMA7</name>
               <displayName>OTG_HS_DIEPDMA7</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x1F4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DIEPDMA8</name>
               <displayName>OTG_HS_DIEPDMA8</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x214</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DIEPDMA9</name>
               <displayName>OTG_HS_DIEPDMA9</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x234</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DIEPDMA10</name>
               <displayName>OTG_HS_DIEPDMA10</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x254</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DIEPDMA11</name>
               <displayName>OTG_HS_DIEPDMA11</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x274</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DIEPDMA12</name>
               <displayName>OTG_HS_DIEPDMA12</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x294</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DIEPDMA13</name>
               <displayName>OTG_HS_DIEPDMA13</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x2B4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DIEPDMA14</name>
               <displayName>OTG_HS_DIEPDMA14</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x2D4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>OTG_HS_DIEPDMA15</name>
               <displayName>OTG_HS_DIEPDMA15</displayName>
               <description>OTG Device channel-x DMA address           register</description>
               <addressOffset>0x2F4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
