bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x3.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>USBPHYC</name>
         <description>USBPHYC register interface</description>
         <groupName>USBPHYC</groupName>
         <baseAddress>0x40017C00</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PLL1</name>
               <displayName>PLL1</displayName>
               <description>USBPHYC PLL1 control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>PLL1EN</name>
                     <description>Enable the PLL1 inside PHY</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL1SEL</name>
                     <description>: Controls the PHY PLL1 input clock frequency selection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TUNE</name>
               <displayName>TUNE</displayName>
               <description>USBPHYC tuning control register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000004</resetValue>
               <fields>
                  <field>
                     <name>INCURREN</name>
                     <description>Controls the current boosting function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INCURRINT</name>
                     <description>Controls PHY current boosting</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LFSCAPEN</name>
                     <description>: Enables the Low Full Speed feedback capacitor</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSDRVSLEW</name>
                     <description>Controls the HS driver slew rate</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSDRVDCCUR</name>
                     <description>Decreases the HS driver DC level</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSDRVDCLEV</name>
                     <description>Increases the HS Driver DC level. Not applicable during the HS Test J and Test K data transfer</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSDRVCURINCR</name>
                     <description>Enable the HS driver current increase feature</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSDRVRFADJ</name>
                     <description>Tuning pin to adjust the full speed rise/fall time</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSDRVRFRED</name>
                     <description>High Speed rise-fall reduction enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSDRVCHKITRM</name>
                     <description>HS Driver current trimming pins for choke compensation</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>HSDRVCHKZTRM</name>
                     <description>Controls the PHY bus HS driver impedance tuning for choke compensation</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SQLCHCTL</name>
                     <description>Adjust the squelch DC threshold value</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>HDRXGNEQEN</name>
                     <description>Enables the HS Rx Gain Equalizer</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STAGSEL</name>
                     <description>HS Tx staggering enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSFALLPREEM</name>
                     <description>HS Fall time control of single ended signals during pre-emphasis</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSRXOFF</name>
                     <description>: HS Receiver Offset adjustment</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SHTCCTCTLPROT</name>
                     <description>Enables the short circuit protection circuitry in LS/FS driver</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SQLBYP</name>
                     <description>This pin is used to bypass the squelch inter-locking circuitry</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LDO</name>
               <displayName>LDO</displayName>
               <description>USBPHYC LDO control and status register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <resetValue>0X00000001</resetValue>
               <fields>
                  <field>
                     <name>LDO_USED</name>
                     <description>Indicates the presence of the LDO in the chip</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LDO_STATUS</name>
                     <description>Monitors the status of the PHY's LDO</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LDO_DISABLE</name>
                     <description>Controls disable of the High Speed PHY's LDO</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
   </peripherals>
</device>
